In [1]:
              ###    Missing Data

In [2]:
import numpy as np
import pandas as pd

In [9]:
df=pd.DataFrame({'A':[5,8,3,np.nan],
                 'B':[5,10,np.nan,np.nan],
                 'C':[1,2,3,23,]})

In [10]:
df

     A     B   C
0  5.0   5.0   1
1  8.0  10.0   2
2  3.0   NaN   3
3  NaN   NaN  23

In [11]:
df.dropna()

     A     B  C
0  5.0   5.0  1
1  8.0  10.0  2

In [14]:
df.dropna(axis=1)

    C
0   1
1   2
2   3
3  23

In [15]:
df.dropna(thresh=2)

     A     B  C
0  5.0   5.0  1
1  8.0  10.0  2
2  3.0   NaN  3

In [16]:
df.fillna(value='fill value')

            A           B   C
0         5.0         5.0   1
1         8.0        10.0   2
2         3.0  fill value   3
3  fill value  fill value  23

In [22]:
df['A'].fillna(value=df['A'].mean())

0    5.000000
1    8.000000
2    3.000000
3    5.333333
Name: A, dtype: float64

In [24]:
df['B'].fillna(value=df['B'].mean())

0     5.0
1    10.0
2     7.5
3     7.5
Name: B, dtype: float64

In [ ]:
                  ###   Groupby

In [34]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','LG','MSFT','LG','BMW','BMW','MSFT','GOOD'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah','CAR','MV'],
       'prodection':['italy','india','brazil','spine','india','italy','brazil','spine'],
       'Sales':[200,120,340,124,243,350,630,420,]}

In [35]:
df= pd.DataFrame(data)

In [36]:
df

  Company   Person prodection  Sales
0    GOOG      Sam      italy    200
1      LG  Charlie      india    120
2    MSFT      Amy     brazil    340
3      LG  Vanessa      spine    124
4     BMW     Carl      india    243
5     BMW    Sarah      italy    350
6    MSFT      CAR     brazil    630
7    GOOD       MV      spine    420

In [37]:
df.groupby('Company')

In [38]:
a=df.groupby('Company')

In [40]:
a.mean(numeric_only=True)

         Sales
Company
BMW      296.5
GOOD     420.0
GOOG     200.0
LG       122.0
MSFT     485.0

In [41]:
a.max(numeric_only=True)

         Sales
Company
BMW        350
GOOD       420
GOOG       200
LG         124
MSFT       630

In [42]:
a.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
BMW       2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOD      1.0  420.0         NaN  420.0  420.00  420.0  420.00  420.0
GOOG      1.0  200.0         NaN  200.0  200.00  200.0  200.00  200.0
LG        2.0  122.0    2.828427  120.0  121.00  122.0  123.00  124.0
MSFT      2.0  485.0  205.060967  340.0  412.50  485.0  557.50  630.0

In [43]:
a.describe().transpose()['LG']

Sales  count      2.000000
       mean     122.000000
       std        2.828427
       min      120.000000
       25%      121.000000
       50%      122.000000
       75%      123.000000
       max      124.000000
Name: LG, dtype: float64

In [45]:
                                  ######    Data Input and Output ####